### Pandas --> Panel Data

* Data analysis
* One of the powerful tool/package for preprocessing
* Datas represented in table format

#### Agends
* Series- Creation ,Attributes,Methods
* DataFrame -Creation,attributes,Methods
* Indexing and Selection
* In series 1 column and multiple rows
* In DataFrame we have multiple rows and multiple column (Excel)
* Data can be any datatype

### Series
* Sungle col, multiple rows

In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series([5,8,2,81,54])
s1

0     5
1     8
2     2
3    81
4    54
dtype: int64

In [3]:
type(s1)

pandas.core.series.Series

In [4]:
s1.index=[11,22,33,44,55]   ## Name your rows
s1

11     5
22     8
33     2
44    81
55    54
dtype: int64

In [5]:
s2 = pd.Series(np.arange(5).reshape(5,),index=['r1','r2','r3','r4','r5'])
s2

r1    0
r2    1
r3    2
r4    3
r5    4
dtype: int32

In [6]:
## Atributes
s1.shape

(5,)

In [7]:
s1.size

5

In [8]:
s1.ndim

1

In [9]:
s1.dtype

dtype('int64')

In [10]:
## Extract the values
s1[[33,55]]

33     2
55    54
dtype: int64

In [11]:
s1[33]

2

In [12]:
s2[1:4]

r2    1
r3    2
r4    3
dtype: int32

In [13]:
s2[['r2','r3','r4']]

r2    1
r3    2
r4    3
dtype: int32

In [14]:
s2[['r2','r4']]

r2    1
r4    3
dtype: int32

In [15]:
s2['r2':'r4']

r2    1
r3    2
r4    3
dtype: int32

### DataFrame
* 2D data,multiple rows and column
* Similar to excel

In [16]:
## Create dataframe with List,Tuples,dict,array
d1 = pd.DataFrame([[5,6,7],[3,5,6],[8,3,1]])
d1

   0  1  2
0  5  6  7
1  3  5  6
2  8  3  1

In [17]:
type(d1)

pandas.core.frame.DataFrame

In [18]:
d2 = pd.DataFrame(((5,6,7),(3,5,6),(8,3,1)))
d2

ValueError: DataFrame constructor not properly called!

In [19]:
d2 = pd.DataFrame((5,6,7),(3,5,6),(8,3,1))
d2

ValueError: DataFrame constructor not properly called!

In [20]:
## DataFrame with dict
d3=pd.DataFrame({'A':[5,6,7],'B':[8,3,7],'C':[9,1,3]})
d3

   A  B  C
0  5  8  9
1  6  3  1
2  7  7  3

In [21]:
d1.index='r1 r2 r3'.split()
d1.columns ='c1 c2 c3'.split()
d1

    c1  c2  c3
r1   5   6   7
r2   3   5   6
r3   8   3   1

In [22]:
## Q) Create a DataFrame random integer nos and reshape it as (4,3) and rows name is r1,r2,r3......c1,c2,c2

In [23]:
d4=pd.DataFrame(np.random.randint(1,100,12).reshape(4,3),index ='r1 r2 r3 r4'.split(),columns ='c1 c2 c3'.split())
d4

    c1  c2  c3
r1  84  59  19
r2   7  18  72
r3  53  35  20
r4  61  69  76

In [24]:
## Q) create a DF with arange function from 51 to 70 and reshape as (5,4) rows --> 11,22,33.....  col --> A,B<C.........

d5=pd.DataFrame(np.arange(51,71).reshape(5,4),index ='11 22 33 44 55'.split(),columns ='A B C D'.split())
d5

     A   B   C   D
11  51  52  53  54
22  55  56  57  58
33  59  60  61  62
44  63  64  65  66
55  67  68  69  70

In [25]:
## Grabbing data with iloc,loc and condition 

##iloc---> index based location

d5.iloc[1:4,3:]

     D
22  58
33  62
44  66

In [26]:
##Q) Extract 1 to 3 rows with 2nd column

In [27]:
d5.iloc[0:3,1]

11    52
22    56
33    60
Name: B, dtype: int32

In [28]:
d5.loc[:,'B']

11    52
22    56
33    60
44    64
55    68
Name: B, dtype: int32

In [29]:

d5.loc['11':'33','B']

11    52
22    56
33    60
Name: B, dtype: int32

In [30]:
d4

    c1  c2  c3
r1  84  59  19
r2   7  18  72
r3  53  35  20
r4  61  69  76

In [31]:
## Extract 1st row n 4th row and 2nd & 3rd column

d4.loc[['r1','r4'],['c2','c3']]

    c2  c3
r1  59  19
r4  69  76

In [32]:
d4>20

       c1     c2     c3
r1   True   True  False
r2  False  False   True
r3   True   True  False
r4   True   True   True

In [33]:
d4[d4>20]['c3']

r1     NaN
r2    72.0
r3     NaN
r4    76.0
Name: c3, dtype: float64

In [34]:
d4[d4>20][['c3','c1']]

      c3    c1
r1   NaN  84.0
r2  72.0   NaN
r3   NaN  53.0
r4  76.0  61.0

In [35]:
d4.ndim

2

In [36]:
d4[d4>20].loc['r2':,['c3','c1','c2']]

      c3    c1    c2
r2  72.0   NaN   NaN
r3   NaN  53.0  35.0
r4  76.0  61.0  69.0

## Q) Create a Df with 20 number ranges from 51 to 70 and the shape is (5,4) and the index is r1......r5, col is A,B,C,D

* Extract the 3rd row & 5th row and 
* extract the number greater than 60
* Extract last element(70)
* Extract the number which are divisible by 3

* loc --> just give name of rows and column
* iloc --> index based location give index

In [37]:
data = pd.DataFrame(np.random.randint(51,70,20).reshape(5,4))
data.index=['r1','r2','r3','r4','r5']
data.columns=['A','B','C','D']
data

     A   B   C   D
r1  63  51  51  54
r2  56  61  53  68
r3  63  67  62  60
r4  68  59  53  62
r5  51  65  69  59

In [38]:
data.loc[['r3','r5']]

     A   B   C   D
r3  63  67  62  60
r5  51  65  69  59

In [39]:
data[data>60]

       A     B     C     D
r1  63.0   NaN   NaN   NaN
r2   NaN  61.0   NaN  68.0
r3  63.0  67.0  62.0   NaN
r4  68.0   NaN   NaN  62.0
r5   NaN  65.0  69.0   NaN

In [40]:
data.iloc[4,3]

59

In [41]:
data.iloc[4:,3:]

     D
r5  59

In [42]:
data[data%3==0]

       A     B     C     D
r1  63.0  51.0  51.0  54.0
r2   NaN   NaN   NaN   NaN
r3  63.0   NaN   NaN  60.0
r4   NaN   NaN   NaN   NaN
r5  51.0   NaN  69.0   NaN

In [43]:
d5

     A   B   C   D
11  51  52  53  54
22  55  56  57  58
33  59  60  61  62
44  63  64  65  66
55  67  68  69  70

In [45]:
## Grabbing the datas with iloc loC and condition
d5.iloc[1:4,3:]   #2nd row to 4th col

     D
22  58
33  62
44  66

In [46]:
## Q) Extract 1 to 3 rows with 2nd column
d5.iloc[0:3,1]

11    52
22    56
33    60
Name: B, dtype: int32

In [47]:
# Q) Extract 1 to 3 rows with 2nd column
d5.loc['11':'33','B']

11    52
22    56
33    60
Name: B, dtype: int32

In [48]:
d4

    c1  c2  c3
r1  84  59  19
r2   7  18  72
r3  53  35  20
r4  61  69  76

In [49]:
# Extract 1st row n 4th row and 2nd and 3rd column
d4.loc[['r1','r4'],['c2','c3']]

    c2  c3
r1  59  19
r4  69  76

In [50]:
#condition
d4>20

       c1     c2     c3
r1   True   True  False
r2  False  False   True
r3   True   True  False
r4   True   True   True

In [51]:
d4[d4>20]['c3']

r1     NaN
r2    72.0
r3     NaN
r4    76.0
Name: c3, dtype: float64

In [52]:
d4[d4>20].loc['r2':,['c3','c1','c2']]

      c3    c1    c2
r2  72.0   NaN   NaN
r3   NaN  53.0  35.0
r4  76.0  61.0  69.0